package com.uniform.web.AdmsissionInform.contorller;

import com.fasterxml.jackson.databind.ObjectMapper;
import com.uniform.web.AdmsissionInform.entity.SchoolInfo;
import com.uniform.web.AdmsissionInform.entity.SubjectScore;
import org.springframework.context.annotation.Bean;
import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.ResponseBody;
import org.springframework.web.bind.annotation.RestController;

@RestController
@RequestMapping("/api")
public class AdmissionInformController {

    @GetMapping("/admission")
    public String checkInform() {
        String JsonString = "{\n" +
                "    \"학교\": \"호준고등학교\",\n" +
                "    \"성적\": {\n" +
                "        \"1year\": {\n" +
                "            \"1semester\": [\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 49,\n" +
                "                    \"과목평균\": 50.20,\n" +
                "                    \"표준편차\": 19.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학2\",\n" +
                "                    \"단위수\": 1,\n" +
                "                    \"원점수\": 56,\n" +
                "                    \"과목평균\": 54.30,\n" +
                "                    \"표준편차\": 19.1,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"영어\",\n" +
                "                    \"과목\": \"실용영어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 40,\n" +
                "                    \"과목평균\": 48.80,\n" +
                "                    \"표준편차\": 13.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"사회\",\n" +
                "                    \"단위수\": 3,\n" +
                "                    \"원점수\": 57,\n" +
                "                    \"과목평균\": 58.10,\n" +
                "                    \"표준편차\": 18.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"한국사\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 73,\n" +
                "                    \"과목평균\": 51.80,\n" +
                "                    \"표준편차\": 21.9,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 3\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"과학\",\n" +
                "                    \"과목\": \"과학\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 31,\n" +
                "                    \"과목평균\": 48.40,\n" +
                "                    \"표준편차\": 21.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"체육\",\n" +
                "                    \"과목\": \"운동과건강생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 88,\n" +
                "                    \"과목평균\": 84.40,\n" +
                "                    \"표준편차\": 6.4,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"예술(음악/미술)\",\n" +
                "                    \"과목\": \"음악과생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 84,\n" +
                "                    \"과목평균\": 83.80,\n" +
                "                    \"표준편차\": 8.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                }\n" +
                "            ],\n" +
                "            \"2semester\": [\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 49,\n" +
                "                    \"과목평균\": 50.20,\n" +
                "                    \"표준편차\": 19.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학2\",\n" +
                "                    \"단위수\": 1,\n" +
                "                    \"원점수\": 56,\n" +
                "                    \"과목평균\": 54.30,\n" +
                "                    \"표준편차\": 19.1,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"영어\",\n" +
                "                    \"과목\": \"실용영어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 40,\n" +
                "                    \"과목평균\": 48.80,\n" +
                "                    \"표준편차\": 13.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"사회\",\n" +
                "                    \"단위수\": 3,\n" +
                "                    \"원점수\": 57,\n" +
                "                    \"과목평균\": 58.10,\n" +
                "                    \"표준편차\": 18.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"한국사\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 73,\n" +
                "                    \"과목평균\": 51.80,\n" +
                "                    \"표준편차\": 21.9,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 3\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"과학\",\n" +
                "                    \"과목\": \"과학\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 31,\n" +
                "                    \"과목평균\": 48.40,\n" +
                "                    \"표준편차\": 21.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"체육\",\n" +
                "                    \"과목\": \"운동과건강생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 88,\n" +
                "                    \"과목평균\": 84.40,\n" +
                "                    \"표준편차\": 6.4,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"예술(음악/미술)\",\n" +
                "                    \"과목\": \"음악과생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 84,\n" +
                "                    \"과목평균\": 83.80,\n" +
                "                    \"표준편차\": 8.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                }\n" +
                "            ]\n" +
                "        },\n" +
                "        \"2year\": {\n" +
                "            \"1semester\": [\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 49,\n" +
                "                    \"과목평균\": 50.20,\n" +
                "                    \"표준편차\": 19.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학2\",\n" +
                "                    \"단위수\": 1,\n" +
                "                    \"원점수\": 56,\n" +
                "                    \"과목평균\": 54.30,\n" +
                "                    \"표준편차\": 19.1,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"영어\",\n" +
                "                    \"과목\": \"실용영어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 40,\n" +
                "                    \"과목평균\": 48.80,\n" +
                "                    \"표준편차\": 13.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"사회\",\n" +
                "                    \"단위수\": 3,\n" +
                "                    \"원점수\": 57,\n" +
                "                    \"과목평균\": 58.10,\n" +
                "                    \"표준편차\": 18.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"한국사\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 73,\n" +
                "                    \"과목평균\": 51.80,\n" +
                "                    \"표준편차\": 21.9,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 3\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"과학\",\n" +
                "                    \"과목\": \"과학\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 31,\n" +
                "                    \"과목평균\": 48.40,\n" +
                "                    \"표준편차\": 21.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"체육\",\n" +
                "                    \"과목\": \"운동과건강생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 88,\n" +
                "                    \"과목평균\": 84.40,\n" +
                "                    \"표준편차\": 6.4,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"예술(음악/미술)\",\n" +
                "                    \"과목\": \"음악과생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 84,\n" +
                "                    \"과목평균\": 83.80,\n" +
                "                    \"표준편차\": 8.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                }\n" +
                "            ],\n" +
                "            \"2semester\": [\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 49,\n" +
                "                    \"과목평균\": 50.20,\n" +
                "                    \"표준편차\": 19.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학2\",\n" +
                "                    \"단위수\": 1,\n" +
                "                    \"원점수\": 56,\n" +
                "                    \"과목평균\": 54.30,\n" +
                "                    \"표준편차\": 19.1,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"영어\",\n" +
                "                    \"과목\": \"실용영어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 40,\n" +
                "                    \"과목평균\": 48.80,\n" +
                "                    \"표준편차\": 13.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"사회\",\n" +
                "                    \"단위수\": 3,\n" +
                "                    \"원점수\": 57,\n" +
                "                    \"과목평균\": 58.10,\n" +
                "                    \"표준편차\": 18.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"한국사\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 73,\n" +
                "                    \"과목평균\": 51.80,\n" +
                "                    \"표준편차\": 21.9,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 3\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"과학\",\n" +
                "                    \"과목\": \"과학\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 31,\n" +
                "                    \"과목평균\": 48.40,\n" +
                "                    \"표준편차\": 21.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"체육\",\n" +
                "                    \"과목\": \"운동과건강생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 88,\n" +
                "                    \"과목평균\": 84.40,\n" +
                "                    \"표준편차\": 6.4,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"예술(음악/미술)\",\n" +
                "                    \"과목\": \"음악과생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 84,\n" +
                "                    \"과목평균\": 83.80,\n" +
                "                    \"표준편차\": 8.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                }\n" +
                "            ]\n" +
                "        },\n" +
                "        \"3year\": {\n" +
                "            \"1semester\": [\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 49,\n" +
                "                    \"과목평균\": 50.20,\n" +
                "                    \"표준편차\": 19.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학2\",\n" +
                "                    \"단위수\": 1,\n" +
                "                    \"원점수\": 56,\n" +
                "                    \"과목평균\": 54.30,\n" +
                "                    \"표준편차\": 19.1,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"영어\",\n" +
                "                    \"과목\": \"실용영어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 40,\n" +
                "                    \"과목평균\": 48.80,\n" +
                "                    \"표준편차\": 13.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"사회\",\n" +
                "                    \"단위수\": 3,\n" +
                "                    \"원점수\": 57,\n" +
                "                    \"과목평균\": 58.10,\n" +
                "                    \"표준편차\": 18.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"한국사\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 73,\n" +
                "                    \"과목평균\": 51.80,\n" +
                "                    \"표준편차\": 21.9,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 3\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"과학\",\n" +
                "                    \"과목\": \"과학\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 31,\n" +
                "                    \"과목평균\": 48.40,\n" +
                "                    \"표준편차\": 21.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"체육\",\n" +
                "                    \"과목\": \"운동과건강생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 88,\n" +
                "                    \"과목평균\": 84.40,\n" +
                "                    \"표준편차\": 6.4,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"예술(음악/미술)\",\n" +
                "                    \"과목\": \"음악과생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 84,\n" +
                "                    \"과목평균\": 83.80,\n" +
                "                    \"표준편차\": 8.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                }\n" +
                "            ],\n" +
                "            \"2semester\": [\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"국어\",\n" +
                "                    \"과목\": \"국어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 59,\n" +
                "                    \"과목평균\": 58.20,\n" +
                "                    \"표준편차\": 16.8,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 49,\n" +
                "                    \"과목평균\": 50.20,\n" +
                "                    \"표준편차\": 19.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"수학\",\n" +
                "                    \"과목\": \"수학2\",\n" +
                "                    \"단위수\": 1,\n" +
                "                    \"원점수\": 56,\n" +
                "                    \"과목평균\": 54.30,\n" +
                "                    \"표준편차\": 19.1,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"영어\",\n" +
                "                    \"과목\": \"실용영어1\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 40,\n" +
                "                    \"과목평균\": 48.80,\n" +
                "                    \"표준편차\": 13.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"사회\",\n" +
                "                    \"단위수\": 3,\n" +
                "                    \"원점수\": 57,\n" +
                "                    \"과목평균\": 58.10,\n" +
                "                    \"표준편차\": 18.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 5\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"사회(역사/도덕포함)\",\n" +
                "                    \"과목\": \"한국사\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 73,\n" +
                "                    \"과목평균\": 51.80,\n" +
                "                    \"표준편차\": 21.9,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 3\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"과학\",\n" +
                "                    \"과목\": \"과학\",\n" +
                "                    \"단위수\": 4,\n" +
                "                    \"원점수\": 31,\n" +
                "                    \"과목평균\": 48.40,\n" +
                "                    \"표준편차\": 21.6,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": 6\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"체육\",\n" +
                "                    \"과목\": \"운동과건강생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 88,\n" +
                "                    \"과목평균\": 84.40,\n" +
                "                    \"표준편차\": 6.4,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                },\n" +
                "                {\n" +
                "                    \"교과\": \"예술(음악/미술)\",\n" +
                "                    \"과목\": \"음악과생활\",\n" +
                "                    \"단위수\": 2,\n" +
                "                    \"원점수\": 84,\n" +
                "                    \"과목평균\": 83.80,\n" +
                "                    \"표준편차\": 8.3,\n" +
                "                    \"수강자수\": 243,\n" +
                "                    \"석차등급\": null\n" +
                "                }\n" +
                "            ]\n" +
                "        }\n" +
                "    }\n" +
                "}";
        try {
            ObjectMapper objectMapper = new ObjectMapper();
            SchoolInfo schoolInfo = objectMapper.readValue(JsonString, SchoolInfo.class);
            String subject = schoolInfo.getScores().getFirstYear().getFirstSemester().get(1).getSubject();
            System.out.println(subject);
            return subject;
        } catch (Exception e) {
            e.printStackTrace();
            return null;
        }
    }
}